<template>
  <h1 class="text-black text-3xl text-center mt-4">
    Как подключиться к кабельной сети ООО "Конкорт-1"
  </h1>
  <p class="text-black text-base mt-4 text-justify">
    ООО "Конкорт-1" предоставляет своим абонентам несколько пакетов программ — "социальный" и
    "базовый". Возможность смотреть программы в цифровом качестве есть у обладателей обоих пакетов.
  </p>
  <p class="text-black text-base mt-4 text-justify">
    Для этого Вам необходимо подойти с паспортом по адресу ул.Комсомольская 18 и оформить договор.
  </p>
  <p class="text-black text-base mt-4 text-justify">
    Стоимость подключения к сети кабельного телевидения — 300 рублей.
  </p>
  <p class="text-black text-base mt-4 text-justify">
    Ежемесячная абонентская плата — от 260 рублей (социальный) до 360 рублей (базовый).
  </p>
  <p class="text-black text-base mt-4 text-justify">Стоимость цифрового декодера — 1900 рублей.</p>
  <p class="text-black text-base mt-4 text-justify">
    Для владельцев телевизоров нового поколения со встроенным цифровым тюнером и с поддержкой
    стандарта DVB-C, у нас есть отдельное предложение. Чтобы смотреть программы в цифровом формате
    по нашей кабельной сети, достаточно приобрести у нас модуль декодера. Его стоимость — 1300
    рублей. Единственное что требуется в этом случае - это произвести тестирование телевизора на
    совместимость с нашим оборудованием. Иногда достаточно поменять программное обеспечение в
    телевизоре.
  </p>
</template>
<style scoped>
p {
  font-family: 'Roboto';
}
</style>
