<script setup lang="ts"></script>

<template>
  <body>
    <h1 class="text-black text-2xl text-center mt-4">О нас</h1>
    <p class="text-black text-base text-justify mt-4">
      OOO «Конкорт-1» предоставляет услуги кабельного телевидения жителям города Кондопоги. Мы
      работаем на телекоммуникационном рынке более 10 лет, и это позволяет оценить нас как
      стабильную и надежную компанию, пользующуюся доверием горожан. Об этом свидетельствует тот
      факт, что услугами нашей компании пользуются 80% жителей города Кондопоги.
    </p>
    <h2 class="text-black text-xl mt-4 text-justify">
      Воспользуйтесь нашими услугами и Вы получите ряд преимуществ:
    </h2>
    <p class="text-black text-base mt-4 text-justify">
      Более 100 каналов, которые включают в себя разнообразные жанры современного телевидения:
      сериалы, документальные фильмы, художественные фильмы отечественного и зарубежного
      производства, музыкальные, публицистические, аналитические и информационные программы с
      высоким цифровым качеством изображения, что позволяет удовлетворить самых взыскательных
      зрителей.
    </p>
    <p class="text-black text-base mt-4 text-justify">
      Вы будете в курсе всех новостей города, посмотрев новостной телеканал «КтвК», созданный для
      Вас. Вы сами каждый день участвуете в создании новостей, давая нашим корреспондентам интервью,
      участвуя в различных городских мероприятиях. На телеканале «КтвК» каждый горожанин может
      разместить: поздравления для близких, родных, любимых людей; рекламу; объявления.
    </p>
    <p class="text-black text-base mt-4 text-justify italic">
      Наши услуги отличаются высоким уровнем качества и приемлимыми ценами. Если Вы еще не
      подключились к сети кабельного телевидения, то мы будем рады видеть Вас в числе наших
      абонентов!
    </p>
  </body>
</template>
<style scoped>
p,
h2 {
  color: #f0eee6;
}
body {
  background-color: #0e1212;
}
h1 {
  color: #cb8741;
}
</style>
