<template>
  <h1 class="text-2xl text-center mt-6">ООО «КОНКОРТ-1» Кабельное телевидение г.Кондопога</h1>
  <p class="text-base mt-6 text-justify font-normal">
    ООО «КОНКОРТ-1» – мультисервисный оператор, предоставляющий услуги цифрового и кабельного
    телевидения. «КОНКОРТ-1» уже сегодня в Кондопоге оказывает мультимедийные услуги с помощью
    сетей, не имеющих аналогов в регионе. Сейчас в пакет предоставляемых услуг входят кабельное и
    цифровое телевидение по технологии DVB-C.
  </p>
  <p class="text-base mt-4 text-justify">
    Сегодня даже самый изысканный телегурман сможет найти свою любимую программу. Вашему вниманию
    предоставлен весь спектр тематических каналов: новостные и спортивные, музыкальные и
    развлекательные, каналы стран ближнего зарубежья.
  </p>
  <p class="text-base mt-4 text-justify">
    Коллектив журналистов, работающий в нашей телекомпании, готовит для вас информационную программу
    на телеканале «КТВК». Все самое интересное, что происходит в городе, вы увидите глазами наших
    репортеров.
  </p>
  <p class="text-base mt-4 text-justify">
    Один из основных принципов работы «КОНКОРТ-1» – высокий уровень обслуживания абонентов, мы
    обеспечиваем квалифицированную техническую поддержку, у нас отсутствуют скрытые платежи.
    Подключайтесь - мы рады каждому абоненту!
  </p>
</template>
<style scoped>
h1,
p {
  color: #f0eee6;
}
h1 {
  color: #cb8741;
}
</style>
