<script setup lang="ts">
import { Button } from '@/components/ui/button'
import {
  Pagination,
  PaginationEllipsis,
  PaginationFirst,
  PaginationLast,
  PaginationList,
  PaginationListItem,
  PaginationNext,
  PaginationPrev
} from '@/components/ui/pagination'
import type { reverse } from 'dns'

const items = [
  {
    id: 1,
    title: `Ребрендинг телеканала «Русский иллюзион»`,
    date: '12 сентября 2012г.',
    text: `Уважаемые абоненты! с 1 сентября Компания «Клуб 100» представляет ребрендинг своего флагманского телеканала — «Русский иллюзион»!
Новый «Русский иллюзион» — это зеркало русской души, загадочной и непредсказуемой, сильной и жизнелюбивой, сострадающей и непримиримой. Только зрителям нашего канала мы дарим возможность испытать самые разнообразные чувства и эмоций, переживая вместе с героями фильмов прошлое и настоящее нашей Родины. На нашем канале поселились любовь и дружба, вера и верность, надежда и терпение, взаимовыручка и отвага, трудолюбие и доброта, гостеприимство, самоирония и широта натуры. Все это наш зритель найдет в подборке лучших отечественных фильмов всех времен на новом «Русском иллюзионе»!`
  },
  {
    id: 2,
    title: `Телеканал «Звезда» в социальном пакете`,
    date: '01 октября 2012г.',
    text: `Уважаемые абоненты! С 01 октября 2012 г. телеканал  «Звезда»  доступен абонентам социального пакета. «Звезда» — телеканал, принадлежащий медиагруппе «Звезда», которую курирует Министерство обороны Российской Федерации посредством ОАО "Телерадиокомпания Вооруженных сил Российской Федерации «Звезда». Полное название телеканала: «Национальная телевизионная компания „Звезда“». Телеканал «Звезда» начал свое вещание 20 февраля 2005 года на 57-м дециметровом канале, имеет статус федерального канала и является каналом общего просмотра. С 16 мая 2005 года круглосуточный эфир телеканала «Звезда» наполняет художественный кинопоказ, документальное кино, программы и передачи о российской армии, ток-шоу, научно-популярные, публицистические и детские программы.
`
  },
  {
    id: 3,
    title: `«Первый HD» в Социальном пакете.`,
    date: `30 апреля 2013г.`,
    text: `Уважаемые абоненты. Спешим сообщить Вам, что в пакет "Социальный " включен «Первый канал» высокой четкости. Телеканал доступен на телевизорах FullHD и HD-Ready.`
  },
  {
    id: 4,
    title: ` С Днем Победы! `,
    date: `08 мая 2013г.`,
    text: `Уважаемые Абоненты! Поздравляем вас с праздником 9 мая! Сегодня мы говорим СПАСИБО всем Ветеранам, подарившим нам Победу, и хотим пожелать всем здоровья, счастья и мирного неба над головой.`
  },
  {
    id: 5,
    title: `Телеканал «Общественное телевидение России» (ОТР).`,
    date: `20 мая 2013г.`,
    text: `Уважаемые абоненты!  В России начал вещание телеканал «Общественное телевидение России». «Общественное телевидение России» — новый российский федеральный телеканал, создаваемый на принципах общественного вещания. Главная характеристика общественного вещания — независимость. Программы «Общественного телевидения России» должны представить все — кроме противозаконных — точки зрения и позиции, существующие в российском обществе по тому или иному вопросу. Ни одна из позиций не должна иметь приоритета. Основные цели и задачи «Общественного телевидения России»:
    - развитие гражданского общества в России;
- просвещение и образование;
- пропаганда общечеловеческих моральных ценностей.
На «Общественном телевидении России» не будет ни рекламы, ни развлекательного контента. Большая часть программ — познавательные: передачи о науке и культуре, качественное документальное и советское кино. Много внимания будет уделяться жизни российских регионов.`
  },
  {
    id: 6,
    title: `Телеканал «Россия HD».`,
    date: `27 июня 2013г.`,
    text: `Уважаемые абоненты. В пакет "Социальный " включен телеканал «Россия HD» высокой четкости. Телеканал «Россия HD» - цифровой телеканал в формате высокой четкости. В эфире – информационная программа «Вести», другие программы производства ВГТРК, а также познавательные передачи каналов «Наука 2.0» и «Моя планета», спорт, фильмы, сериалы, музыка, мультфильмы для детей.`
  },
  {
    id: 7,
    title: 'Теперь возможна оплата картой',
    date: ` 11 декабря 2013г. `,
    text: ` Уважаемые абоненты!
 Уведомляем Вас, что теперь в нашем офисе можно оплатить услуги ООО "Конкорт-1" с использованием банковских карт Visa, Master Card, Maestro, Visa Electron.
 `
  },
  {
    id: 8,
    title: `Телеканал «Авто 24»`,
    date: ` 20 декабря 2013г. `,
    text: `«Авто24» — новый тематический телеканал, посвященный автомобилям, автомобильному спорту и автолюбительству. Производитель канала — компания “Контент Юнион”, уже известная по телеканалам “Детский”, “Русский иллюзион”, “Иллюзион+”, “Зоопарк” и другими. Новый телеканал семейства производится в эксклюзивном партнерстве с немецкими медиа-холдингом Motor Presse TV и телеканалом Auto Motor Sport (AMS), не менее 30% контента составят программы собственного производства.`
  },
  {
    id: 9,
    title: `Олимпиада в HD`,
    date: ` 22 января 2014г. `,
    text: `Приближаются XXII зимние Олимпийские игры. Остались считанные дни до старта самого главного спортивного события, к которому напряженно готовятся спортсмены и организаторы, корреспонденты и комментаторы, и которое с нетерпением ждут миллионы болельщиков со всего мира.

Смотрите прямые трансляции в идеальном качестве на телеканалах «Первый HD» и «Россия HD!»`
  },
  {
    id: 10,
    title: `Телеканалы «A1» и «A2»`,
    date: `01 апреля 2014г.`,
    text: `«A1» - Телеканал с широким выбором мужских жанров: от экшн-блокбастеров и черных комедий до серьезной документалистики. Эксклюзивные премьеры ведущих студий мира (CBS, Lionsgate, Studio Canal, Sky) по выходным дням.
    «A2» - Телеканал, где собраны самые популярные женские жанры: мелодрамы, комедии и исторические драмы. По выходным дням — эксклюзивные премьеры ведущих мировых студий (CBS, Lionsgate, Fremantle, Sky). От золотой классики до актуальных новинок`
  },
  {
    id: 11,
    title: `Телеканалы «СТС» и «ТНТ» перенесены в "Социальный пакет"`,
    date: `01 апреля 2014г.`,
    text: `Уважаемые абоненты!
Хотим сообщить, что с 01 апреля телеканалы «СТС» и «ТНТ» переносятся в "Социальный пакет".
Просьба произвести автонастройку телевизоров.
`
  },
  {
    id: 12,
    title: `С Днем России!`,
    date: `11 июня 2014г.`,
    text: `Поздравляем С Днем России!
День России — праздник единения и гордости, что отмечается в жаркий день лета. Особенно актуальна и многозначительна эта дата в свете последних достижений нашей Родины, в свете той волны патриотизма, что прокатилась по просторам государства в последние месяцы. К событию имеет причастность каждый — кто работает на благо страны по роду профессиональной деятельности, кто живёт здесь, не желая покидать родные пенаты, и кто здесь просто родился, и любит своё государство.
`
  },
  {
    id: 13,
    title: `Телеканалы «2х2» и «Пятница»`,
    date: ` 27 октября 2014г. `,
    text: `Телеканал «2Х2» - Развлекательный молодёжный телеканал для тех, кто ценит юмор, сатиру, пародию. Основа контента – мультсериалы разных жанров, адресованные преимущественно взрослой аудитории, снятые в США, странах Европы и Азии. Среди них – культовые «Южный парк», «Футурама», «Гриффины» и самый длинный мультсериал в истории - «Симпсоны». В эфире канала представлены также короткометражные игровые фильмы и минисериалы.
    Телеканал «Пятница» - Развлекательный телеканал для молодёжной аудитории. В эфире – реалити-шоу, юмористические и пародийные программы, российские комедийные сериалы, мировое кино, передачи о моде и стиле, кулинарии и образе жизни. `
  },
  {
    id: 14,
    title: `Телеканал «360° Подмосковье»`,
    date: `27 октября 2014г.`,
    text: `«360° Подмосковье» – новости, развлекательные программы, спецпроекты и несколько собственных линеек документальных фильмов о Московской области. Новости выходят каждый час, запускается документальный сериал о героических поступках обычных людей - “Герои 360”. У Телеканала «360° Подмосковье» есть первый в России телевизионный вертолет для оперативных съёмок событий, автомобильных пробок, природы, интересных мест Московской области, строящихся инфраструктурных объектов.`
  },
  {
    id: 15,
    title: `C Новым 2015 годом!`,
    date: `31 декабря 2014г.`,
    text: `Поздравляем наших абонентов, партнеров и просто друзей компании с  Новым Годом и Рождеством!
Пусть он принесет всем нам радость и веселье, улыбки и хорошее настроение, сделает красивыми и счастливыми, добрыми и сильными! Пусть каждый ощутит Новогоднее Чудо! Пусть сбываются желания, загаданные в новогоднюю ночь! А семьи ваши живут в достатке и благополучии! `
  },
  {
    id: 16,
    title: `Телеканал «Мать и дитя»`,
    date: `19 января 2015г.`,
    text: `«Мать и дитя» — первый в России круглосуточный познавательный телеканал для родителей. Официальный слоган: «Для родителей, которым интересно с детьми». Канал формирует современную позитивную философию родительства, помогает лучше понимать детей и растить их счастливыми.
Наполнение канала «Мать и дитя» охватывает такие темы, как беременность и роды, здоровье, воспитание и образование детей, досуг с детьми, психологические и юридические аспекты материнства и детства, семейные взаимоотношения, организация пространства для детей в доме.
1 февраля 2015 года название телеканала было изменено на «Мама».`
  },
  {
    id: 17,
    title: `Телеканалы «СТС Love» и «Домашний»`,
    date: `19 января 2015г.`,
    text: `«СТС Love» – канал о реальных чувствах. Любимые сериалы, реалити и собственные проекты СТС Медиа о любви и отношениях, в которых все ситуации близки и знакомы, это сериалы про нас.
Это знакомые герои и позитивные эмоции для тех, кто во всем видит светлую сторону. «СТС Love» – твой канал о настоящих чувствах и переживаниях. «СТС Love» – твой канал о настоящей любви.`
  },
  {
    id: 18,
    title: `C Новым 2016 годом!`,
    date: `31 декабря 2015г.`,
    text: `Поздравляем наших абонентов, партнеров и просто друзей компании с  Новым Годом и Рождеством!
Желаем вам в грядущем новом году мира, добра, здоровья, как можно больше тепла и уюта, неисчерпаемых жизненных сил, достижения поставленных целей, пусть новый год сопровождается только положительными эмоциями и знаменательными событиями.`
  },
  {
    id: 19,
    title: `Бесплатные объявления на телеканале «КТВК»`,
    date: `25 июля 2016г.`,
    text: `Хотите разместить объявление или поздравить родных и близких?
На телеканале «КТВК» Вы можете сделать это совершенно бесплатно.
Предложение действительно только для физических лиц.
`
  },
  {
    id: 20,
    title: `Мы переехали!`,
    date: ` 09 февраля 2017г. `,
    text: `Уважаемые абоненты!
Мы переехали!
Наш новый адрес: г. Кондопога, ул. Комсомольская д.18.
Режим работы: пн.-пт. 9:00-18:00, обед 13:00-14:00.
Выходные: суббота и воскресенье.
Всегда рады вас видеть!`
  },
  {
    id: 21,
    title: `Поздравляем с Великой Победой!`,
    date: `05 мая 2017г.`,
    text: `Поздравляем с Днем победы ветеранов, всех, кто участвовал в боевых действиях и всех людей, которым дороги мир и благополучие!
Желаем крепкого железного здоровья, бодрости духа, чуткости души и уважения окружающих!
Любви вам светлой и доброй, признания и вдохновения, весны цветущей круглый год и радости бытия!
Пусть близкие люди дарят вам внимание, понимание и любовь! Будьте счастливы и живите в мире!`
  },
  {
    id: 22,
    title: `Оплата через Сбербанк - Онлайн`,
    date: `06 июня 2019г.`,
    text: `Уважаемые абоненты! Теперь Вы можете оплачивать услугу кабельного телевидения через систему «Сбербанк Онлайн». Для этого достаточно найти нашу компанию «Конкорт-1» в системе, выбрать её, после чего ввести свой лицевой счет (лицевой счет указан на квитанции), нажать «продолжить», ввести сумму оплаты, снова нажать «продолжить» и нажать на «подтвердить». После этого денежные средства будут зачислены на Ваш лицевой счет.
Обратите внимание, что в системе «Сбербанк Онлайн» при оплате услуги кабельного телевидения в поле «лицевой счет» должно быть указано 6 цифр! Соответственно, если Ваш лицевой счет состоит менее, чем из 6 цифр, то слева необходимо дописать нули так, чтобы в итоге получилось 6 цифр (например, если номер Вашего лицевого счета 888, то в систему «Сбербанк Онлайн» необходимо ввести 000888).
Также при оплате через приложение «Сбербанк Онлайн» можно считать QR-код, который находится на полученной Вами квитанции. QR-код выглядит как заштрихованный квадрат. Для этого в приложении «Сбербанк Онлайн» нужно выбрать «Конкорт-1», нажать «Отсканировать штрих-код», выбрать карту, с которой будет оплачиваться услуга, нажать «продолжить». После этого навести камеру смартфона на заштрихованный квадратик, после чего проверить номер лицевого счета в графе «лицевой счет» и сумму в графе «сумма платежа». Если всё верно, то нажать «продолжить». После этого денежные средства будут зачислены на Ваш лицевой счет.
По всем интересующим Вас вопросам обращайтесь по телефонам: 7-44-64; 7-32-11.
`
  }
].reverse()
</script>

<template>
  <div class="[&>*] fade-text">
    <div class="flex justify-center mb-6">
      <h1 class="text-2xl text-orange-400 background-with-opacity p-2">Новости</h1>
    </div>
    <div v-for="i in items" class="text-white text-justify pb-2" :key="i.id">
      <div class="background-with-opacity p-2">
        <div class="lg:pb-2 lg:justify-between hidden lg:flex">
          <span class="text-orange-400">{{ i.title }} </span>
          <span class="">{{ i.date }}</span>
        </div>
        <div class="pb-2 lg:hidden">
          <div class="text-orange-400 pb-2">{{ i.title }}</div>
          <div class="">{{ i.date }}</div>
        </div>
        <p class="pb-2 whitespace-pre-line">{{ i.text }}</p>
      </div>
      <hr class="border-orange-400 mt-2" />
    </div>
  </div>

  <!--  <div>{{ items }}</div>
  <Pagination v-slot="{ page }" :total="100" :sibling-count="1" show-edges :default-page="1">
    <PaginationList v-slot="{ items }" class="flex items-center gap-1">
      <PaginationFirst />

      <PaginationPrev />

      <template v-for="(item, index) in items">
        <PaginationListItem v-if="item.type === 'page'" :key="index" :value="item.value" as-child>
          <Button class="w-10 h-10 p-0" :variant="item.value === page ? 'default' : 'outline'">
            {{ item.value }}
          </Button>
        </PaginationListItem>
        <PaginationEllipsis v-else :key="item.type" :index="index" />
      </template>

      <PaginationNext />
      <PaginationLast />
    </PaginationList>
  </Pagination> -->
</template>
<style scoped>
.background-with-opacity {
  background: rgba(14, 18, 18, 0.75);
  border-radius: 15px;
}
p {
  text-shadow: rgba(250, 250, 250, 0.25) 0px 0px 3px;
}
.fade-text {
  animation: fade-in 750ms;
}
@keyframes fade-in {
  0% {
    opacity: 0;
  }
  100% {
    opacity: 1;
  }
}
</style>
